; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v9 ?v11)
             (pred_7 ?v6 ?v8)
             (pred_4 ?v9 ?v8)
             (pred_1 ?v2 ?v9 )
	     (pred_2 ?v9)
             (pred_5 ?v4)
             (pred_6 ?v6)
             (pred_11 ?v8)
             (pred_3 ?v9)
             (pred_12 ?v6)
             (pred_8 ?v9)
             (pred_10 ))



(:action op_2
:parameters (?v5 ?v12 ?v3 ?v10)
:precondition (and (pred_5 ?v5) (pred_5 ?v12) (pred_6 ?v3) (pred_11 ?v10)
          (pred_9 ?v5 ?v12) (pred_7 ?v3 ?v10)
                   (pred_4 ?v12 ?v10) (pred_2 ?v5) 
                   (pred_3 ?v12) (pred_12 ?v3))
:effect (and  (pred_8 ?v12) (not (pred_3 ?v12))))


(:action op_4
:parameters (?v5 ?v13)
:precondition (and (pred_5 ?v5) (pred_5 ?v13)
               (pred_2 ?v5) (pred_9 ?v5 ?v13) (pred_8 ?v13))
:effect (and (pred_2 ?v13) (not (pred_2 ?v5))))

(:action op_3
:parameters (?v5 ?v3)
:precondition (and (pred_5 ?v5) (pred_6 ?v3) 
                  (pred_2 ?v5) (pred_1 ?v3 ?v5) (pred_10 ))
:effect (and (pred_12 ?v3)
   (not (pred_1 ?v3 ?v5)) (not (pred_10 ))))


(:action op_5
:parameters (?v5 ?v7 ?v1)
:precondition (and (pred_5 ?v5) (pred_6 ?v7) (pred_6 ?v1)
                  (pred_2 ?v5) (pred_12 ?v1) (pred_1 ?v7 ?v5))
:effect (and (pred_12 ?v7) (pred_1 ?v1 ?v5)
        (not (pred_12 ?v1)) (not (pred_1 ?v7 ?v5))))

(:action op_1
:parameters (?v5 ?v3)
:precondition (and (pred_5 ?v5) (pred_6 ?v3) 
                  (pred_2 ?v5) (pred_12 ?v3))
:effect (and (pred_10 ) (pred_1 ?v3 ?v5) (not (pred_12 ?v3)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_29 obj_07 obj_26 obj_19 obj_10 obj_11 obj_30 obj_15 obj_22 obj_08 obj_21 obj_16 obj_04 obj_23 obj_24 obj_05 obj_03 obj_17 obj_02 obj_13 obj_31 obj_14 obj_20 obj_28 obj_25
    obj_12 obj_01 obj_18
    obj_09 obj_27 obj_06
    )

    (:init
       (pred_10)

       (pred_5 obj_29)
       (pred_5 obj_07)
       (pred_5 obj_26)
       (pred_5 obj_19)
       (pred_5 obj_10)
       (pred_5 obj_11)
       (pred_5 obj_30)
       (pred_5 obj_15)
       (pred_5 obj_22)
       (pred_5 obj_08)
       (pred_5 obj_21)
       (pred_5 obj_16)
       (pred_5 obj_04)
       (pred_5 obj_23)
       (pred_5 obj_24)
       (pred_5 obj_05)
       (pred_5 obj_03)
       (pred_5 obj_17)
       (pred_5 obj_02)
       (pred_5 obj_13)
       (pred_5 obj_31)
       (pred_5 obj_14)
       (pred_5 obj_20)
       (pred_5 obj_28)
       (pred_5 obj_25)
       (pred_11 obj_12)
       (pred_11 obj_01)
       (pred_11 obj_18)
       (pred_6 obj_09)
       (pred_6 obj_27)
       (pred_6 obj_06)

       (pred_9 obj_29 obj_11)
       (pred_9 obj_29 obj_07)
       (pred_9 obj_07 obj_30)
       (pred_9 obj_07 obj_26)
       (pred_9 obj_07 obj_29)
       (pred_9 obj_26 obj_15)
       (pred_9 obj_26 obj_19)
       (pred_9 obj_26 obj_07)
       (pred_9 obj_19 obj_22)
       (pred_9 obj_19 obj_10)
       (pred_9 obj_19 obj_26)
       (pred_9 obj_10 obj_08)
       (pred_9 obj_10 obj_19)
       (pred_9 obj_11 obj_21)
       (pred_9 obj_11 obj_30)
       (pred_9 obj_11 obj_29)
       (pred_9 obj_30 obj_16)
       (pred_9 obj_30 obj_15)
       (pred_9 obj_30 obj_07)
       (pred_9 obj_30 obj_11)
       (pred_9 obj_15 obj_04)
       (pred_9 obj_15 obj_22)
       (pred_9 obj_15 obj_26)
       (pred_9 obj_15 obj_30)
       (pred_9 obj_22 obj_23)
       (pred_9 obj_22 obj_08)
       (pred_9 obj_22 obj_19)
       (pred_9 obj_22 obj_15)
       (pred_9 obj_08 obj_24)
       (pred_9 obj_08 obj_10)
       (pred_9 obj_08 obj_22)
       (pred_9 obj_21 obj_05)
       (pred_9 obj_21 obj_16)
       (pred_9 obj_21 obj_11)
       (pred_9 obj_16 obj_03)
       (pred_9 obj_16 obj_04)
       (pred_9 obj_16 obj_30)
       (pred_9 obj_16 obj_21)
       (pred_9 obj_04 obj_17)
       (pred_9 obj_04 obj_23)
       (pred_9 obj_04 obj_15)
       (pred_9 obj_04 obj_16)
       (pred_9 obj_23 obj_02)
       (pred_9 obj_23 obj_24)
       (pred_9 obj_23 obj_22)
       (pred_9 obj_23 obj_04)
       (pred_9 obj_24 obj_13)
       (pred_9 obj_24 obj_08)
       (pred_9 obj_24 obj_23)
       (pred_9 obj_05 obj_31)
       (pred_9 obj_05 obj_03)
       (pred_9 obj_05 obj_21)
       (pred_9 obj_03 obj_14)
       (pred_9 obj_03 obj_17)
       (pred_9 obj_03 obj_16)
       (pred_9 obj_03 obj_05)
       (pred_9 obj_17 obj_20)
       (pred_9 obj_17 obj_02)
       (pred_9 obj_17 obj_04)
       (pred_9 obj_17 obj_03)
       (pred_9 obj_02 obj_28)
       (pred_9 obj_02 obj_13)
       (pred_9 obj_02 obj_23)
       (pred_9 obj_02 obj_17)
       (pred_9 obj_13 obj_25)
       (pred_9 obj_13 obj_24)
       (pred_9 obj_13 obj_02)
       (pred_9 obj_31 obj_14)
       (pred_9 obj_31 obj_05)
       (pred_9 obj_14 obj_20)
       (pred_9 obj_14 obj_03)
       (pred_9 obj_14 obj_31)
       (pred_9 obj_20 obj_28)
       (pred_9 obj_20 obj_17)
       (pred_9 obj_20 obj_14)
       (pred_9 obj_28 obj_25)
       (pred_9 obj_28 obj_02)
       (pred_9 obj_28 obj_20)
       (pred_9 obj_25 obj_13)
       (pred_9 obj_25 obj_28)
       (pred_3 obj_15)
       (pred_3 obj_08)
       (pred_3 obj_14)
       (pred_4  obj_15 obj_12)
       (pred_4  obj_08 obj_01)
       (pred_4  obj_14 obj_18)
       (pred_8 obj_29)
       (pred_8 obj_07)
       (pred_8 obj_26)
       (pred_8 obj_19)
       (pred_8 obj_10)
       (pred_8 obj_11)
       (pred_8 obj_30)
       (pred_8 obj_22)
       (pred_8 obj_21)
       (pred_8 obj_16)
       (pred_8 obj_04)
       (pred_8 obj_23)
       (pred_8 obj_24)
       (pred_8 obj_05)
       (pred_8 obj_03)
       (pred_8 obj_17)
       (pred_8 obj_02)
       (pred_8 obj_13)
       (pred_8 obj_31)
       (pred_8 obj_20)
       (pred_8 obj_28)
       (pred_8 obj_25)

       (pred_7  obj_09 obj_12)
       (pred_7  obj_27 obj_01)
       (pred_7  obj_06 obj_18)
       (pred_1 obj_09 obj_02)
       (pred_1 obj_27 obj_23)
       (pred_1 obj_06 obj_31)
       (pred_2 obj_30)
    )

    (:goal (and
       (pred_1 obj_09 obj_10)
       (pred_1 obj_27 obj_20)
       (pred_1 obj_06 obj_22)
    ))
(:constraints
  (always (not (pred_2 obj_04)))
)
)

; plan
1. (op_4 obj_30 obj_16)
   deleted: (pred_2 obj_30)
   added: (pred_2 obj_16)
   goals met: 0 of 3
2. (op_4 obj_16 obj_03)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_03)
   goals met: 0 of 3
3. (op_4 obj_03 obj_17)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_17)
   goals met: 0 of 3
4. (op_4 obj_17 obj_02)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_02)
   goals met: 0 of 3
5. (op_3 obj_02 obj_09)
   deleted: (pred_1 obj_09 obj_02) (pred_10)
   added: (pred_12 obj_09)
   goals met: 0 of 3
6. (op_4 obj_02 obj_23)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_23)
   goals met: 0 of 3
7. (op_4 obj_23 obj_22)
   deleted: (pred_2 obj_23)
   added: (pred_2 obj_22)
   goals met: 0 of 3
8. (op_1 obj_22 obj_09)
   deleted: (pred_12 obj_09)
   added: (pred_10) (pred_1 obj_09 obj_22)
   goals met: 0 of 3
9. (op_4 obj_22 obj_23)
   deleted: (pred_2 obj_22)
   added: (pred_2 obj_23)
   goals met: 0 of 3
10. (op_3 obj_23 obj_27)
   deleted: (pred_1 obj_27 obj_23) (pred_10)
   added: (pred_12 obj_27)
   goals met: 0 of 3
11. (op_4 obj_23 obj_02)
   deleted: (pred_2 obj_23)
   added: (pred_2 obj_02)
   goals met: 0 of 3
12. (op_4 obj_02 obj_17)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_17)
   goals met: 0 of 3
13. (op_4 obj_17 obj_20)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_20)
   goals met: 0 of 3
14. (op_1 obj_20 obj_27)
   deleted: (pred_12 obj_27)
   added: (pred_10) (pred_1 obj_27 obj_20)
   goals met: 1 of 3
15. (op_4 obj_20 obj_17)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_17)
   goals met: 1 of 3
16. (op_4 obj_17 obj_02)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_02)
   goals met: 1 of 3
17. (op_4 obj_02 obj_23)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_23)
   goals met: 1 of 3
18. (op_4 obj_23 obj_22)
   deleted: (pred_2 obj_23)
   added: (pred_2 obj_22)
   goals met: 1 of 3
19. (op_3 obj_22 obj_09)
   deleted: (pred_1 obj_09 obj_22) (pred_10)
   added: (pred_12 obj_09)
   goals met: 1 of 3
20. (op_4 obj_22 obj_19)
   deleted: (pred_2 obj_22)
   added: (pred_2 obj_19)
   goals met: 1 of 3
21. (op_4 obj_19 obj_10)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_10)
   goals met: 1 of 3
22. (op_1 obj_10 obj_09)
   deleted: (pred_12 obj_09)
   added: (pred_10) (pred_1 obj_09 obj_10)
   goals met: 2 of 3
23. (op_4 obj_10 obj_19)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_19)
   goals met: 2 of 3
24. (op_4 obj_19 obj_22)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_22)
   goals met: 2 of 3
25. (op_4 obj_22 obj_23)
   deleted: (pred_2 obj_22)
   added: (pred_2 obj_23)
   goals met: 2 of 3
26. (op_4 obj_23 obj_02)
   deleted: (pred_2 obj_23)
   added: (pred_2 obj_02)
   goals met: 2 of 3
27. (op_4 obj_02 obj_17)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_17)
   goals met: 2 of 3
28. (op_4 obj_17 obj_03)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_03)
   goals met: 2 of 3
29. (op_4 obj_03 obj_05)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_05)
   goals met: 2 of 3
30. (op_4 obj_05 obj_31)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_31)
   goals met: 2 of 3
31. (op_3 obj_31 obj_06)
   deleted: (pred_1 obj_06 obj_31) (pred_10)
   added: (pred_12 obj_06)
   goals met: 2 of 3
32. (op_4 obj_31 obj_05)
   deleted: (pred_2 obj_31)
   added: (pred_2 obj_05)
   goals met: 2 of 3
33. (op_4 obj_05 obj_03)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_03)
   goals met: 2 of 3
34. (op_4 obj_03 obj_17)
   deleted: (pred_2 obj_03)
   added: (pred_2 obj_17)
   goals met: 2 of 3
35. (op_4 obj_17 obj_02)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_02)
   goals met: 2 of 3
36. (op_4 obj_02 obj_23)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_23)
   goals met: 2 of 3
37. (op_4 obj_23 obj_22)
   deleted: (pred_2 obj_23)
   added: (pred_2 obj_22)
   goals met: 2 of 3
38. (op_1 obj_22 obj_06)
   deleted: (pred_12 obj_06)
   added: (pred_10) (pred_1 obj_06 obj_22)
   goals met: 3 of 3
